---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SketchGridSpacingParam
source: html/f5229f8a-eecc-8c7c-5945-660f5d873b32.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SketchGridSpacingParam Property

"Work Plane Grid Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId SketchGridSpacingParam { get; }
```